###################################################################

# Created by write_sdc on Wed Feb 17 00:13:33 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {pc[31]}]
set_load -pin_load 3.40189 [get_ports {pc[30]}]
set_load -pin_load 3.40189 [get_ports {pc[29]}]
set_load -pin_load 3.40189 [get_ports {pc[28]}]
set_load -pin_load 3.40189 [get_ports {pc[27]}]
set_load -pin_load 3.40189 [get_ports {pc[26]}]
set_load -pin_load 3.40189 [get_ports {pc[25]}]
set_load -pin_load 3.40189 [get_ports {pc[24]}]
set_load -pin_load 3.40189 [get_ports {pc[23]}]
set_load -pin_load 3.40189 [get_ports {pc[22]}]
set_load -pin_load 3.40189 [get_ports {pc[21]}]
set_load -pin_load 3.40189 [get_ports {pc[20]}]
set_load -pin_load 3.40189 [get_ports {pc[19]}]
set_load -pin_load 3.40189 [get_ports {pc[18]}]
set_load -pin_load 3.40189 [get_ports {pc[17]}]
set_load -pin_load 3.40189 [get_ports {pc[16]}]
set_load -pin_load 3.40189 [get_ports {pc[15]}]
set_load -pin_load 3.40189 [get_ports {pc[14]}]
set_load -pin_load 3.40189 [get_ports {pc[13]}]
set_load -pin_load 3.40189 [get_ports {pc[12]}]
set_load -pin_load 3.40189 [get_ports {pc[11]}]
set_load -pin_load 3.40189 [get_ports {pc[10]}]
set_load -pin_load 3.40189 [get_ports {pc[9]}]
set_load -pin_load 3.40189 [get_ports {pc[8]}]
set_load -pin_load 3.40189 [get_ports {pc[7]}]
set_load -pin_load 3.40189 [get_ports {pc[6]}]
set_load -pin_load 3.40189 [get_ports {pc[5]}]
set_load -pin_load 3.40189 [get_ports {pc[4]}]
set_load -pin_load 3.40189 [get_ports {pc[3]}]
set_load -pin_load 3.40189 [get_ports {pc[2]}]
set_load -pin_load 3.40189 [get_ports {pc[1]}]
set_load -pin_load 3.40189 [get_ports {pc[0]}]
set_load -pin_load 3.40189 [get_ports {out_rf[31]}]
set_load -pin_load 3.40189 [get_ports {out_rf[30]}]
set_load -pin_load 3.40189 [get_ports {out_rf[29]}]
set_load -pin_load 3.40189 [get_ports {out_rf[28]}]
set_load -pin_load 3.40189 [get_ports {out_rf[27]}]
set_load -pin_load 3.40189 [get_ports {out_rf[26]}]
set_load -pin_load 3.40189 [get_ports {out_rf[25]}]
set_load -pin_load 3.40189 [get_ports {out_rf[24]}]
set_load -pin_load 3.40189 [get_ports {out_rf[23]}]
set_load -pin_load 3.40189 [get_ports {out_rf[22]}]
set_load -pin_load 3.40189 [get_ports {out_rf[21]}]
set_load -pin_load 3.40189 [get_ports {out_rf[20]}]
set_load -pin_load 3.40189 [get_ports {out_rf[19]}]
set_load -pin_load 3.40189 [get_ports {out_rf[18]}]
set_load -pin_load 3.40189 [get_ports {out_rf[17]}]
set_load -pin_load 3.40189 [get_ports {out_rf[16]}]
set_load -pin_load 3.40189 [get_ports {out_rf[15]}]
set_load -pin_load 3.40189 [get_ports {out_rf[14]}]
set_load -pin_load 3.40189 [get_ports {out_rf[13]}]
set_load -pin_load 3.40189 [get_ports {out_rf[12]}]
set_load -pin_load 3.40189 [get_ports {out_rf[11]}]
set_load -pin_load 3.40189 [get_ports {out_rf[10]}]
set_load -pin_load 3.40189 [get_ports {out_rf[9]}]
set_load -pin_load 3.40189 [get_ports {out_rf[8]}]
set_load -pin_load 3.40189 [get_ports {out_rf[7]}]
set_load -pin_load 3.40189 [get_ports {out_rf[6]}]
set_load -pin_load 3.40189 [get_ports {out_rf[5]}]
set_load -pin_load 3.40189 [get_ports {out_rf[4]}]
set_load -pin_load 3.40189 [get_ports {out_rf[3]}]
set_load -pin_load 3.40189 [get_ports {out_rf[2]}]
set_load -pin_load 3.40189 [get_ports {out_rf[1]}]
set_load -pin_load 3.40189 [get_ports {out_rf[0]}]
set_load -pin_load 3.40189 [get_ports {alu_result[31]}]
set_load -pin_load 3.40189 [get_ports {alu_result[30]}]
set_load -pin_load 3.40189 [get_ports {alu_result[29]}]
set_load -pin_load 3.40189 [get_ports {alu_result[28]}]
set_load -pin_load 3.40189 [get_ports {alu_result[27]}]
set_load -pin_load 3.40189 [get_ports {alu_result[26]}]
set_load -pin_load 3.40189 [get_ports {alu_result[25]}]
set_load -pin_load 3.40189 [get_ports {alu_result[24]}]
set_load -pin_load 3.40189 [get_ports {alu_result[23]}]
set_load -pin_load 3.40189 [get_ports {alu_result[22]}]
set_load -pin_load 3.40189 [get_ports {alu_result[21]}]
set_load -pin_load 3.40189 [get_ports {alu_result[20]}]
set_load -pin_load 3.40189 [get_ports {alu_result[19]}]
set_load -pin_load 3.40189 [get_ports {alu_result[18]}]
set_load -pin_load 3.40189 [get_ports {alu_result[17]}]
set_load -pin_load 3.40189 [get_ports {alu_result[16]}]
set_load -pin_load 3.40189 [get_ports {alu_result[15]}]
set_load -pin_load 3.40189 [get_ports {alu_result[14]}]
set_load -pin_load 3.40189 [get_ports {alu_result[13]}]
set_load -pin_load 3.40189 [get_ports {alu_result[12]}]
set_load -pin_load 3.40189 [get_ports {alu_result[11]}]
set_load -pin_load 3.40189 [get_ports {alu_result[10]}]
set_load -pin_load 3.40189 [get_ports {alu_result[9]}]
set_load -pin_load 3.40189 [get_ports {alu_result[8]}]
set_load -pin_load 3.40189 [get_ports {alu_result[7]}]
set_load -pin_load 3.40189 [get_ports {alu_result[6]}]
set_load -pin_load 3.40189 [get_ports {alu_result[5]}]
set_load -pin_load 3.40189 [get_ports {alu_result[4]}]
set_load -pin_load 3.40189 [get_ports {alu_result[3]}]
set_load -pin_load 3.40189 [get_ports {alu_result[2]}]
set_load -pin_load 3.40189 [get_ports {alu_result[1]}]
set_load -pin_load 3.40189 [get_ports {alu_result[0]}]
set_load -pin_load 3.40189 [get_ports data_mem_read]
set_load -pin_load 3.40189 [get_ports data_mem_write]
set_load -pin_load 3.40189 [get_ports pipe_stall]
set_load -pin_load 3.40189 [get_ports pipe_flush1]
set_load -pin_load 3.40189 [get_ports pipe_flush2]
create_clock [get_ports clk]  -name my_clk  -period 5  -waveform {0 2.5}
set_clock_uncertainty 0.07  [get_clocks my_clk]
set_input_delay -clock my_clk  -max 0.5  [get_ports rst]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[31]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[30]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[29]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[28]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[27]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[26]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[25]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[24]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[23]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[22]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[21]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[20]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[19]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[18]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[17]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[16]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[15]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[14]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[13]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[12]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[11]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[10]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[9]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[8]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[7]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[6]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[5]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[4]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[3]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[2]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[1]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {instruction[0]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[31]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[30]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[29]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[28]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[27]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[26]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[25]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[24]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[23]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[22]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[21]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[20]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[19]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[18]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[17]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[16]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[15]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[14]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[13]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[12]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[11]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[10]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[9]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[8]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[7]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[6]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[5]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[4]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[3]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[2]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[1]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {data[0]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[31]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[30]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[29]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[28]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[27]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[26]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[25]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[24]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[23]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[22]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[21]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[20]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[19]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[18]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[17]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[16]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[15]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[14]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[13]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[12]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[11]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[10]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[9]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[8]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[7]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[6]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[5]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[4]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[3]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[2]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[1]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {pc[0]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[31]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[30]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[29]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[28]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[27]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[26]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[25]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[24]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[23]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[22]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[21]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[20]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[19]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[18]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[17]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[16]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[15]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[14]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[13]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[12]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[11]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[10]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[9]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[8]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[7]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[6]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[5]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[4]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[3]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[2]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[1]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {out_rf[0]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[31]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[30]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[29]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[28]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[27]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[26]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[25]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[24]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[23]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[22]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[21]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[20]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[19]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[18]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[17]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[16]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[15]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[14]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[13]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[12]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[11]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[10]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[9]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[8]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[7]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[6]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[5]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[4]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[3]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[2]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[1]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {alu_result[0]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports data_mem_read]
set_output_delay -clock my_clk  -max 0.5  [get_ports data_mem_write]
set_output_delay -clock my_clk  -max 0.5  [get_ports pipe_stall]
set_output_delay -clock my_clk  -max 0.5  [get_ports pipe_flush1]
set_output_delay -clock my_clk  -max 0.5  [get_ports pipe_flush2]
